---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportLayerTableIterator
source: html/f6660902-9adb-4bc9-948a-819d661e77d1.htm
---
# ExportLayerTableIterator Methods

Identifies if the iteration has completed.